garyPenhook/PIC-Assembler/edc/PIC18F46Q24.PIC
        <edc:JoinedSFRDef edc:cname="NVMADR" edc:desc="" edc:name="NVMADR" edc:nzwidth="0x10" edc:_addr="0x43">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NVMADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NVMADRL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x43">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NVMADRL" edc:mask="0xff" edc:name="NVMADRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NVMADR0" edc:mask="0x1" edc:name="NVMADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR1" edc:mask="0x1" edc:name="NVMADR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR2" edc:mask="0x1" edc:name="NVMADR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR3" edc:mask="0x1" edc:name="NVMADR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR4" edc:mask="0x1" edc:name="NVMADR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR5" edc:mask="0x1" edc:name="NVMADR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR6" edc:mask="0x1" edc:name="NVMADR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR7" edc:mask="0x1" edc:name="NVMADR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NVMADRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NVMADRH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x44">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NVMADRH" edc:mask="0xff" edc:name="NVMADRH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NVMADR8" edc:mask="0x1" edc:name="NVMADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR9" edc:mask="0x1" edc:name="NVMADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR10" edc:mask="0x1" edc:name="NVMADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR11" edc:mask="0x1" edc:name="NVMADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR12" edc:mask="0x1" edc:name="NVMADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR13" edc:mask="0x1" edc:name="NVMADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR14" edc:mask="0x1" edc:name="NVMADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR15" edc:mask="0x1" edc:name="NVMADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="NVMADRU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="NVMADRU" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x45">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NVMADRU" edc:mask="0x3f" edc:name="NVMADRU" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NVMADR16" edc:mask="0x1" edc:name="NVMADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR17" edc:mask="0x1" edc:name="NVMADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR18" edc:mask="0x1" edc:name="NVMADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR19" edc:mask="0x1" edc:name="NVMADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR20" edc:mask="0x1" edc:name="NVMADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR21" edc:mask="0x1" edc:name="NVMADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="NVMDAT" edc:desc="" edc:name="NVMDAT" edc:nzwidth="0x10" edc:_addr="0x46">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NVMDATL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NVMDATL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x46">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NVMDATL" edc:mask="0xff" edc:name="NVMDATL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NVMDAT0" edc:mask="0x1" edc:name="NVMDAT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT1" edc:mask="0x1" edc:name="NVMDAT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT2" edc:mask="0x1" edc:name="NVMDAT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT3" edc:mask="0x1" edc:name="NVMDAT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT4" edc:mask="0x1" edc:name="NVMDAT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT5" edc:mask="0x1" edc:name="NVMDAT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT6" edc:mask="0x1" edc:name="NVMDAT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT7" edc:mask="0x1" edc:name="NVMDAT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NVMDATH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NVMDATH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x47">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NVMDATH" edc:mask="0xff" edc:name="NVMDATH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NVMDAT8" edc:mask="0x1" edc:name="NVMDAT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT9" edc:mask="0x1" edc:name="NVMDAT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT10" edc:mask="0x1" edc:name="NVMDAT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT11" edc:mask="0x1" edc:name="NVMDAT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT12" edc:mask="0x1" edc:name="NVMDAT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT13" edc:mask="0x1" edc:name="NVMDAT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT14" edc:mask="0x1" edc:name="NVMDAT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMDAT15" edc:mask="0x1" edc:name="NVMDAT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
