garyPenhook/PIC-Assembler/edc/PIC18F46Q24.PIC
        <edc:JoinedSFRDef edc:cname="TU16BTMR" edc:desc="" edc:name="TU16BTMR" edc:nzwidth="0x10" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3AF">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TU16BCR"/>
          </edc:AliasList>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x3AF">
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x1">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BTMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BTMRL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3AF">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="TMRL" edc:desc="" edc:mask="0xff" edc:name="TMRL" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="TMRL0" edc:mask="0x1" edc:name="TMRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL1" edc:mask="0x1" edc:name="TMRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL2" edc:mask="0x1" edc:name="TMRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL3" edc:mask="0x1" edc:name="TMRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL4" edc:mask="0x1" edc:name="TMRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL5" edc:mask="0x1" edc:name="TMRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL6" edc:mask="0x1" edc:name="TMRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL7" edc:mask="0x1" edc:name="TMRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BTMRL0" edc:mask="0x1" edc:name="TU16BTMRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL1" edc:mask="0x1" edc:name="TU16BTMRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL2" edc:mask="0x1" edc:name="TU16BTMRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL3" edc:mask="0x1" edc:name="TU16BTMRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL4" edc:mask="0x1" edc:name="TU16BTMRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL5" edc:mask="0x1" edc:name="TU16BTMRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL6" edc:mask="0x1" edc:name="TU16BTMRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL7" edc:mask="0x1" edc:name="TU16BTMRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BTMR0" edc:mask="0x1" edc:name="TU16BTMR0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR1" edc:mask="0x1" edc:name="TU16BTMR1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR2" edc:mask="0x1" edc:name="TU16BTMR2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR3" edc:mask="0x1" edc:name="TU16BTMR3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR4" edc:mask="0x1" edc:name="TU16BTMR4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR5" edc:mask="0x1" edc:name="TU16BTMR5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR6" edc:mask="0x1" edc:name="TU16BTMR6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR7" edc:mask="0x1" edc:name="TU16BTMR7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x0">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="TU16BCRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BCRL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3AF">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="CRL" edc:desc="" edc:mask="0xff" edc:name="CRL" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="CRL0" edc:mask="0x1" edc:name="CRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL1" edc:mask="0x1" edc:name="CRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL2" edc:mask="0x1" edc:name="CRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL3" edc:mask="0x1" edc:name="CRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL4" edc:mask="0x1" edc:name="CRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL5" edc:mask="0x1" edc:name="CRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL6" edc:mask="0x1" edc:name="CRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL7" edc:mask="0x1" edc:name="CRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BCRL0" edc:mask="0x1" edc:name="TU16BCRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL1" edc:mask="0x1" edc:name="TU16BCRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL2" edc:mask="0x1" edc:name="TU16BCRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL3" edc:mask="0x1" edc:name="TU16BCRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL4" edc:mask="0x1" edc:name="TU16BCRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL5" edc:mask="0x1" edc:name="TU16BCRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL6" edc:mask="0x1" edc:name="TU16BCRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL7" edc:mask="0x1" edc:name="TU16BCRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BCR0" edc:mask="0x1" edc:name="TU16BCR0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR1" edc:mask="0x1" edc:name="TU16BCR1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR2" edc:mask="0x1" edc:name="TU16BCR2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR3" edc:mask="0x1" edc:name="TU16BCR3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR4" edc:mask="0x1" edc:name="TU16BCR4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR5" edc:mask="0x1" edc:name="TU16BCR5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR6" edc:mask="0x1" edc:name="TU16BCR6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR7" edc:mask="0x1" edc:name="TU16BCR7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x3B0">
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x1">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BTMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BTMRH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3B0">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="TMRH" edc:desc="" edc:mask="0xff" edc:name="TMRH" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="TMRH0" edc:mask="0x1" edc:name="TMRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH1" edc:mask="0x1" edc:name="TMRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH2" edc:mask="0x1" edc:name="TMRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH3" edc:mask="0x1" edc:name="TMRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH4" edc:mask="0x1" edc:name="TMRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH5" edc:mask="0x1" edc:name="TMRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH6" edc:mask="0x1" edc:name="TMRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH7" edc:mask="0x1" edc:name="TMRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BTMRH0" edc:mask="0x1" edc:name="TU16BTMRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH1" edc:mask="0x1" edc:name="TU16BTMRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH2" edc:mask="0x1" edc:name="TU16BTMRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH3" edc:mask="0x1" edc:name="TU16BTMRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH4" edc:mask="0x1" edc:name="TU16BTMRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH5" edc:mask="0x1" edc:name="TU16BTMRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH6" edc:mask="0x1" edc:name="TU16BTMRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH7" edc:mask="0x1" edc:name="TU16BTMRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BTMR8" edc:mask="0x1" edc:name="TU16BTMR8" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR9" edc:mask="0x1" edc:name="TU16BTMR9" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR10" edc:mask="0x1" edc:name="TU16BTMR10" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR11" edc:mask="0x1" edc:name="TU16BTMR11" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR12" edc:mask="0x1" edc:name="TU16BTMR12" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR13" edc:mask="0x1" edc:name="TU16BTMR13" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR14" edc:mask="0x1" edc:name="TU16BTMR14" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR15" edc:mask="0x1" edc:name="TU16BTMR15" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x0">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="TU16BCRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BCRH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3B0">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="CRH" edc:desc="" edc:mask="0xff" edc:name="CRH" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="CRH0" edc:mask="0x1" edc:name="CRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH1" edc:mask="0x1" edc:name="CRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH2" edc:mask="0x1" edc:name="CRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH3" edc:mask="0x1" edc:name="CRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH4" edc:mask="0x1" edc:name="CRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH5" edc:mask="0x1" edc:name="CRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH6" edc:mask="0x1" edc:name="CRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH7" edc:mask="0x1" edc:name="CRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BCRH0" edc:mask="0x1" edc:name="TU16BCRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH1" edc:mask="0x1" edc:name="TU16BCRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH2" edc:mask="0x1" edc:name="TU16BCRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH3" edc:mask="0x1" edc:name="TU16BCRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH4" edc:mask="0x1" edc:name="TU16BCRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH5" edc:mask="0x1" edc:name="TU16BCRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH6" edc:mask="0x1" edc:name="TU16BCRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH7" edc:mask="0x1" edc:name="TU16BCRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BCR8" edc:mask="0x1" edc:name="TU16BCR8" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR9" edc:mask="0x1" edc:name="TU16BCR9" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR10" edc:mask="0x1" edc:name="TU16BCR10" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR11" edc:mask="0x1" edc:name="TU16BCR11" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR12" edc:mask="0x1" edc:name="TU16BCR12" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR13" edc:mask="0x1" edc:name="TU16BCR13" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR14" edc:mask="0x1" edc:name="TU16BCR14" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR15" edc:mask="0x1" edc:name="TU16BCR15" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x3B1"/>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x3B2">
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x1">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BTMRT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BTMRT" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3B2">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="TMRT" edc:mask="0xff" edc:name="TMRT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="TMRT0" edc:mask="0x1" edc:name="TMRT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT1" edc:mask="0x1" edc:name="TMRT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT2" edc:mask="0x1" edc:name="TMRT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT3" edc:mask="0x1" edc:name="TMRT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT4" edc:mask="0x1" edc:name="TMRT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT5" edc:mask="0x1" edc:name="TMRT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT6" edc:mask="0x1" edc:name="TMRT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT7" edc:mask="0x1" edc:name="TMRT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BTMRT0" edc:mask="0x1" edc:name="TU16BTMRT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT1" edc:mask="0x1" edc:name="TU16BTMRT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT2" edc:mask="0x1" edc:name="TU16BTMRT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT3" edc:mask="0x1" edc:name="TU16BTMRT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT4" edc:mask="0x1" edc:name="TU16BTMRT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT5" edc:mask="0x1" edc:name="TU16BTMRT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT6" edc:mask="0x1" edc:name="TU16BTMRT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT7" edc:mask="0x1" edc:name="TU16BTMRT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BTMR24" edc:mask="0x1" edc:name="TU16BTMR24" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR25" edc:mask="0x1" edc:name="TU16BTMR25" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR26" edc:mask="0x1" edc:name="TU16BTMR26" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR27" edc:mask="0x1" edc:name="TU16BTMR27" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR28" edc:mask="0x1" edc:name="TU16BTMR28" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR29" edc:mask="0x1" edc:name="TU16BTMR29" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR30" edc:mask="0x1" edc:name="TU16BTMR30" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR31" edc:mask="0x1" edc:name="TU16BTMR31" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x0">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="TU16BCRT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BCRT" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3B2">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="CRT" edc:mask="0xff" edc:name="CRT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="CRT0" edc:mask="0x1" edc:name="CRT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT1" edc:mask="0x1" edc:name="CRT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT2" edc:mask="0x1" edc:name="CRT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT3" edc:mask="0x1" edc:name="CRT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT4" edc:mask="0x1" edc:name="CRT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT5" edc:mask="0x1" edc:name="CRT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT6" edc:mask="0x1" edc:name="CRT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT7" edc:mask="0x1" edc:name="CRT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BCRT0" edc:mask="0x1" edc:name="TU16BCRT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT1" edc:mask="0x1" edc:name="TU16BCRT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT2" edc:mask="0x1" edc:name="TU16BCRT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT3" edc:mask="0x1" edc:name="TU16BCRT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT4" edc:mask="0x1" edc:name="TU16BCRT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT5" edc:mask="0x1" edc:name="TU16BCRT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT6" edc:mask="0x1" edc:name="TU16BCRT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT7" edc:mask="0x1" edc:name="TU16BCRT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BCR24" edc:mask="0x1" edc:name="TU16BCR24" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR25" edc:mask="0x1" edc:name="TU16BCR25" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR26" edc:mask="0x1" edc:name="TU16BCR26" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR27" edc:mask="0x1" edc:name="TU16BCR27" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR28" edc:mask="0x1" edc:name="TU16BCR28" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR29" edc:mask="0x1" edc:name="TU16BCR29" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR30" edc:mask="0x1" edc:name="TU16BCR30" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR31" edc:mask="0x1" edc:name="TU16BCR31" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
        </edc:JoinedSFRDef>
