garyPenhook/PIC-Assembler/edc/PIC18F46Q24.PIC
        <edc:SFRDef edc:access="rnnnnrn-" edc:cname="IPR5" edc:desc="" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000-" edc:name="IPR5" edc:nzwidth="8" edc:por="0000000-" edc:_modsrc="DOS-xxxx_Interrupts_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x4A3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC6IP" edc:mask="0x1" edc:name="CLC6IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AIP" edc:mask="0x1" edc:name="TU16AIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR6IP" edc:mask="0x1" edc:name="TMR6IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2IP" edc:mask="0x1" edc:name="C2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2IP" edc:mask="0x1" edc:name="CLC2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2PIP" edc:mask="0x1" edc:name="PWM2PIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IP" edc:mask="0x1" edc:name="PWM2IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR6" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x4A4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT1IP" edc:mask="0x1" edc:name="INT1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC7IP" edc:mask="0x1" edc:name="CLC7IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1IP" edc:mask="0x1" edc:name="CWG1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1IP" edc:mask="0x1" edc:name="NCO1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2SCNTIP" edc:mask="0x1" edc:name="DMA2SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2DCNTIP" edc:mask="0x1" edc:name="DMA2DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2ORIP" edc:mask="0x1" edc:name="DMA2ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2AIP" edc:mask="0x1" edc:name="DMA2AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnn-rrrr" edc:cname="IPR7" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="IPR7" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x4A5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1RXIP" edc:mask="0x1" edc:name="I2C1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1TXIP" edc:mask="0x1" edc:name="I2C1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1IP" edc:mask="0x1" edc:name="I2C1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1EIP" edc:mask="0x1" edc:name="I2C1EIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC3IP" edc:mask="0x1" edc:name="CLC3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3PIP" edc:mask="0x1" edc:name="PWM3PIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3IP" edc:mask="0x1" edc:name="PWM3IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnn-rrrr" edc:cname="IPR8" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="IPR8" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x4A6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U2RXIP" edc:mask="0x1" edc:name="U2RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIP" edc:mask="0x1" edc:name="U2TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2EIP" edc:mask="0x1" edc:name="U2EIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2IP" edc:mask="0x1" edc:name="U2IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC4IP" edc:mask="0x1" edc:name="CLC4IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IP" edc:mask="0x1" edc:name="CCP2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANIP" edc:mask="0x1" edc:name="SCANIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn---n" edc:cname="IPR9" edc:desc="" edc:impl="0xf1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000---0" edc:name="IPR9" edc:nzwidth="8" edc:por="0000---0" edc:_modsrc="DOS-xxxx_Interrupts_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x4A7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1IP" edc:mask="0x1" edc:name="C1IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="DMA3SCNTIP" edc:mask="0x1" edc:name="DMA3SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3DCNTIP" edc:mask="0x1" edc:name="DMA3DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3ORIP" edc:mask="0x1" edc:name="DMA3ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3AIP" edc:mask="0x1" edc:name="DMA3AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrnn" edc:cname="IPR10" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR10" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x4A8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT2IP" edc:mask="0x1" edc:name="INT2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC8IP" edc:mask="0x1" edc:name="CLC8IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BIP" edc:mask="0x1" edc:name="TU16BIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR4IP" edc:mask="0x1" edc:name="TMR4IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4SCNTIP" edc:mask="0x1" edc:name="DMA4SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4DCNTIP" edc:mask="0x1" edc:name="DMA4DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4ORIP" edc:mask="0x1" edc:name="DMA4ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4AIP" edc:mask="0x1" edc:name="DMA4AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnrrr" edc:cname="IPR11" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="IPR11" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxx_Interrupts_Q24_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x4A9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI2RXIP" edc:mask="0x1" edc:name="SPI2RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TXIP" edc:mask="0x1" edc:name="SPI2TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2IP" edc:mask="0x1" edc:name="SPI2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VDDIO2LVDIP" edc:mask="0x1" edc:name="VDDIO2LVDIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VDDIO2nRDYIP" edc:mask="0x1" edc:name="VDDIO2nRDYIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnnrnn" edc:cname="PIE0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q24_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x4AA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWIE" edc:mask="0x1" edc:name="SWIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDIE" edc:mask="0x1" edc:name="HLVDIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSFIE" edc:mask="0x1" edc:name="OSFIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSWIE" edc:mask="0x1" edc:name="CSWIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVMIE" edc:mask="0x1" edc:name="NVMIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC1IE" edc:mask="0x1" edc:name="CLC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIE" edc:mask="0x1" edc:name="CRCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCIE" edc:mask="0x1" edc:name="IOCIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
